# CommandEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CommandEventArgs Class
Members See Also
---
The base class of the command Executed and CanExecute event arguments.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class CommandEventArgs : RevitEventArgs
```

Visual Basic
---
```text
Public Class CommandEventArgs _
	Inherits RevitEventArgs
```

Visual C++
---
```text
public ref class CommandEventArgs : public RevitEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitEventArgs Autodesk.Revit.UI.Events..::..CommandEventArgs Autodesk.Revit.UI.Events..::..BeforeExecutedEventArgs Autodesk.Revit.UI.Events..::..CanExecuteEventArgs Autodesk.Revit.UI.Events..::..ExecutedEventArgs
# See Also
CommandEventArgs Members
Autodesk.Revit.UI.Events Namespace